src/main/java/ok/dht/test/gerasimov/report/wrk2/wrk2_put_rate_20000.txt
Running 1m test @ http://localhost:25565
  1 threads and 1 connections
  Thread calibration: mean lat.: 2071.280ms, rate sampling interval: 7278ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.30s     6.04s   24.64s    55.85%
    Req/Sec    11.67k   212.05    11.99k    66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.46s 
 75.000%   19.50s 
 90.000%   22.64s 
 99.000%   24.46s 
 99.900%   24.64s 
 99.990%   24.66s 
 99.999%   24.66s 
100.000%   24.66s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3958.783     0.000000           25         1.00
    5861.375     0.100000        58620         1.11
    7794.687     0.200000       117206         1.25
   10125.311     0.300000       175952         1.43
   12173.311     0.400000       234414         1.67
   14458.879     0.500000       293006         2.00
   15409.151     0.550000       322557         2.22
   16556.031     0.600000       351709         2.50
   17481.727     0.650000       381008         2.86
   18333.695     0.700000       410540         3.33
   19496.959     0.750000       439835         4.00
   20086.783     0.775000       454219         4.44
   20807.679     0.800000       468870         5.00
   21266.431     0.825000       483474         5.71
   21757.951     0.850000       498159         6.67
   22249.471     0.875000       512759         8.00
   22429.695     0.887500       520218         8.89
   22642.687     0.900000       527733        10.00
   22839.295     0.912500       535246        11.43
   23052.287     0.925000       542598        13.33
   23232.511     0.937500       549574        16.00
   23363.583     0.943750       553536        17.78
   23461.887     0.950000       557249        20.00
   23560.191     0.956250       560387        22.86
   23707.647     0.962500       564240        26.67
   23822.335     0.968750       568176        32.00
   24084.479     0.971875       569608        35.56
   24166.399     0.975000       571718        40.00
   24231.935     0.978125       573360        45.71
   24297.471     0.981250       575244        53.33
   24346.623     0.984375       576892        64.00
   24379.391     0.985938       577882        71.11
   24412.159     0.987500       578915        80.00
   24444.927     0.989062       580065        91.43
   24461.311     0.990625       580638       106.67
   24494.079     0.992188       581714       128.00
   24510.463     0.992969       582180       142.22
   24526.847     0.993750       582663       160.00
   24543.231     0.994531       583074       182.86
   24559.615     0.995313       583482       213.33
   24575.999     0.996094       583895       256.00
   24592.383     0.996484       584305       284.44
   24592.383     0.996875       584305       320.00
   24608.767     0.997266       584735       365.71
   24608.767     0.997656       584735       426.67
   24625.151     0.998047       585094       512.00
   24625.151     0.998242       585094       568.89
   24625.151     0.998437       585094       640.00
   24641.535     0.998633       585647       731.43
   24641.535     0.998828       585647       853.33
   24641.535     0.999023       585647      1024.00
   24641.535     0.999121       585647      1137.78
   24641.535     0.999219       585647      1280.00
   24641.535     0.999316       585647      1462.86
   24657.919     0.999414       585992      1706.67
   24657.919     1.000000       585992          inf
#[Mean    =    14299.897, StdDeviation   =     6043.175]
#[Max     =    24641.536, Total count    =       585992]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  706935 requests in 1.00m, 45.17MB read
Requests/sec:  11782.30
Transfer/sec:    770.91KB